[
  { "id": "name",
    "q": "Your name",
    "class": "lookup_individual",
    "desc": "<p>If this application is for an individual or duo, this should be the main performer name.  If for a group, this should be the name of the group leader.</p><p>Our standard for recording names is LAST, then a comma, then FIRST, and we don't put a space after the comma.</p>" },

  { "id": "email",
    "q": "Your email address", 
    "type": "email" },

  { "id": "phone",
    "q": "What is the best phone number at which to reach you?" },

  { "id": "inperson",
    "q": "Applying to the IN-PERSON Festival?",
    "desc_pre": "<p>We have not yet decided whether the Festival will be in-person or online, but we have no plans to attempt a hybrid Festival.</p><p>You can apply for <strong>one or both</strong> formats.</p><p>Vaccination and safety measures will be in place if there is an in-person Festival; policies will be announced with acceptances.</p>",
    "choices": [
      { "val": "yes", "desc": "Yes: I want to perform at the Festival if it is <strong>in-person</strong>." },
      { "val": "no", "desc": "No: I do <strong>not</strong> wish to apply for the in-person Festival." }
    ]
  },

  { "id": "online",
    "q": "Applying to the ONLINE Festival?",
    "choices": [
      { "val": "yes", "desc": "Yes: I want to perform at the Festival if it is <strong>online</strong>." },
      { "val": "no", "desc": "No: I do <strong>not</strong> wish to apply for the online Festival." }
    ],
    "desc": "Remember, NEFFA will be either in-person or online, but not hybrid.  You should apply for both formats if you are willing to perform at either."
  },

  { "id": "main_performer",
    "q": "Should the performer for this event be listed as an individual, a duo, or a named group?",
    "desc": "The Duo category is for use when two performers are getting together for a special event at NEFFA, but don't want to bother with choosing a group name.  Duos are free to use the Group category, if desired.",
    "choices": [
      { "val": "Individual", "desc": "The individual applying" },
      { "val": "Duo", "desc": "A an-hoc duo consisting of the individual applying and another performer" },
      { "val": "Group", "desc": "A group" }
    ]
  },

  { "id": "performer2",
    "show_if": [ "main_performer", "Duo" ],
    "q": "Second performer name for duo",
    "class": "lookup_individual" },

  { "id": "group_name",
    "show_if": [ "main_performer", "Group" ],
    "class": "lookup_group",
    "q": "Name of group?",
    "desc": "<p>Make sure this name exactly matches the name of your group and avoid abbreviations.  After we complete the initial processing of your application, we'll send you a link that will allow you to manage your group membership list.</p>"
  },

  { "id": "busy",
    "optional": 1,
    "class": "lookup_individual",
    "q": "Other performers (besides group members) supporting this event",
    "desc": "<p>Is there an unbilled accompanist or temporary addition to your band who will be joining you for NEFFA? If this event is scheduled, these people will not be simultaneously scheduled for other events in the same time slot.  You can list one person here, then put any additional names in the comment section at the end.  If this application is for a group, don't list the members here -- you'll receive a link by email that will allow you to manage your membership list.</p>" },


  { "id": "app_category",
    "q": "What category best describes this particular application?",
    "choices": [ 
      { "val": "Band_Solo", 
	"desc": "Dance band proposing a session requiring no additional caller or teacher",
	"deadline": 2 
      },
      { "val": "Band", 
	"desc": "Dance band proposing to play for a session led by a caller or teacher (who is not a member of the band)",
        "deadline": 2
      },
      { "val": "Caller", 
	"desc": "Dance caller or teacher",
        "deadline": 1
      },
      { "val": "Ritual", 
	"desc": "Ritual dance (morris, rapper, etc)",
        "deadline": 3
      },
      { "val": "Other", 
	"desc": "Everything else (folk music, song, storytelling, lectures, discussions, etc)",
	"deadline": 1
      }
    ],
    "desc": "The answer to this question may be different on other applications; please choose the option that best fits with this application only.  Please note that dance bands and callers/dance leaders MUST SUBMIT SEPARATE APPLICATIONS unless the caller is in the band. If a caller wants to work with a specific band, they can specify that below."
  },

  { "id": "dance_style",
    "show_if": [ "app_category", "Band", "Band_Solo", "Caller" ],
    "q": "Which dance committee would be best to evaluate your application?",
    "desc": "Bands may wish to play for more than one type of dance event, but for this application, you have to choose JUST one.  If you would like to be considered for more than one type of dancing, PLEASE fill out another application!",
    "choices": [
      { "val": "American", "desc": "American Dance (contra, square, etc.)" },
      { "val": "Int_Line", "desc": "International Line Dance (Balkan, Israeli, Breton, etc.)" },
      { "val": "English_Couples", "desc": "English, Couples, and Other Dance (e.g. English, Scottish, Irish, Scandi, Polish, waltz, swing, blues, step dance, other)" }
    ]
  },

  { "id": "specific_dance_style",
    "show_if": [ "app_category", "Band" ],
    "textarea": 1,
    "optional": 1,
    "q": "If you have a preference, what specific style or styles of dance would you like to play for?",
    "desc_pre": "Any information you give us here helps to match you with a caller or teacher."
  },

  { "id": "music_pref",
    "show_if": [ "app_category", "Caller" ],
    "q": "Music preference",
    "desc": "NEFFA prefers to use live music whenever possible.  Please note that callers/dance teachers must submit their own applications and dance bands must submit separate applications.",
    "choices": [
      { "val": "band", "desc": "This event needs a band" },
      { "val": "either", "desc": "This event could use a band but I can provide recorded music if live music is not available" },
      { "val": "recorded", "desc": "I prefer to use recorded music, which I will provide" }
    ]
  },

  { "id": "preferred_band",
    "textarea": 1,
    "optional": 1,
    "show_if": [ "music_pref", "band", "either" ],
    "q": "Preferred band",
    "desc": "If you have a preference, please specify what band or bands you would prefer to work with. We may not be able to pair you with your preferred band. Again, note that the band must submit a separate application."},

  { "id": "recorded_type",
    "show_if": [ "music_pref", "either", "recorded" ],
    "q": "Do you need a CD player?",
    "choices": [
      { "val": "Yes" },
      { "val": "No" }
    ]
  },

  { "id": "preferred_caller",
    "textarea": 1,
    "optional": 1,
    "show_if": [ "app_category", "Band" ],
    "q": "Preferred caller/dance leader",
    "desc": "If you have a preference, please specify what callers or dance leaders you would prefer to work with. We may not be able to pair you with your preferred callers or dance leaders. Note that the caller must submit a separate application, even if they are part of your group."
  },

  { "id": "conflicts",
    "show_if": [ "app_category", "Ritual" ],
    "q": "Conflicts and Preferences",
    "textarea": 1,
    "desc": "<p>Please use this box to indicate any other scheduling preferences or potential conflicts. This includes other Morris teams or other NEFFA events/groups involving members of your team. Please use performer/group names as they have been listed on the grid, for example:</p><p>Different time from Best Band Ever<br/>Not in same slot as Morris Team Z<br/>Same day as Choral Group ABC<br/></p>"
  },

  { "id": "availability",
    "type": "radio",
    "q": "Availability",
    "desc_pre": "<p>These hours refer to the times that you are available to perform. Please note that the greater your availability, the greater the likelihood that you will be scheduled.  If some times are better than others, mark them Preferred. <strong>You must make a selection for every timeslot.</strong></p>"
  },

  { "id": "event_title",
    "show_if": [ "app_category", "Band_Solo", "Caller", "Other" ],
    "q": "What is your EVENT'S TITLE? (30 characters at most)",
    "desc": "Please be careful about avoiding spelling errors, and do not use all capital letters. This title will appear on the web Festival Schedule, the Paper Grid, and in the Program Book. When crafting an event title, please try to be descriptive, although cleverness is also welcome. The event title should be different from the group name (for example, don't use  \"[your name] in Concert\") and should provide audience members with an idea of the theme.  The Program Committee may change the title because of printing constraints or clarity issues."
  },

  { "id": "event_desc",
    "show_if": [ "app_category", "Band_Solo", "Caller", "Other" ],
    "q": "Please describe your EVENT (NOT your group!)",
    "textarea": 1,
    "desc": "This is a description of this specific, proposed NEFFA session. This text will be read by Festival-goers. Please avoid spelling errors, and do not use all capital letters. Try to limit this description to no more than 30 words (fewer is better!). This description gives the Program Committee and Festival participants a more precise idea of what to expect from your event. This description should give additional information, and not be a repeat of the Event Title."
  },


  { "id": "event_type",
    "show_if": [ "app_category", "Band_Solo", "Caller", "Other" ],
    "q": "Event Type",
    "choices": [
      { "val": "E", "desc": "ENTERTAINMENT -- Events that people watch or listen to (concerts, performance, etc.)." },
      { "val": "C", "desc": "CHAT -- The audience joins the presenter in discussing a topic of mutual interest." },
      { "val": "P", "desc": "PRESENTATION -- Events which demonstrate a skill or present material, as in a lecture." },
      { "val": "G", "desc": "GROUP PARTICIPATION -- Audience participation is the primary focus, as in group singing, jams, etc." },
      { "val": "T", "desc": "TEACHING FEATURED -- Participatory events that focus on teaching a particular skill." },
      { "val": "D", "desc": "PARTICIPATORY DANCING  -- A leader provides walk-thrus and prompting." },
      { "val": "N", "desc": "NO INSTRUCTION -- Dances featuring no instruction or walk-thrus." }
    ]
  },

  { "id": "level",
    "show_if": [
      [ "app_category", "Band_Solo", "Caller", "Other" ],
      [ "event_type", "G", "T", "D", "N" ]
    ],
    "q": "Level Code",
    "desc": "These level codes indicate the intended level of experience or ability, especially for dance and teaching events.",
    "choices": [
      { "val": "F", "desc": "FAMILY-ORIENTED -- Participatory events geared to families and others who enjoy being with children" },
      { "val": "B", "desc": "BEGINNER-FRIENDLY -- No experience assumed" },
      { "val": "S", "desc": "SOME EXPERIENCE HELPFUL -- Basic knowledge assumed" },
      { "val": "X", "desc": "EXPERIENCED -- Much experience assumed" },
      { "val": "NA", "desc": "Not applicable" }
    ]
  },

  { "id": "room_size",
    "show_if": [ "app_category", "Other" ],
    "textarea": 1,
    "q": "What size room work for this event?",
    "desc_pre": "We have rooms with capacities ranging from 80 to 1000.<br/>  Some can accommodate dancing, and one is a lecture hall with tiered seating.<br/>  Please describe what kind of rooms would work well for your event." 
  },

  { "id": "room_sound",
    "show_if": [ "app_category", "Other" ],
    "q": "Do you need a sound system?",
    "choices": [
      { "val": "none", "desc": "No amplification needed" },
      { "val": "self", "desc": "Self-service performer operated mic" },
      { "val": "full", "desc": "Full sound system (please describe your needs in the Notes section at the end)" }
    ]
  },

  { "id": "piano",
    "show_if": [ "app_category", "Band", "Band_Solo", "Other" ],
    "q": "Do you need a piano?",
    "choices": [
      { "val": "Yes" },
      { "val": "No" }
    ]
  },

  { "id": "sound_needs",
    "show_if": [ "app_category", "Band", "Band_Solo" ],
    "textarea": 1,
    "q": "Sound system requirements.  (Write 'N/A' if you would not use a sound system even if one was available)",
    "desc": "If you are booked for a room with a full sound system, how many inputs do you expect to need, and for what instruments? Please provide as much information as you have at this time. You will not be held to this, but it will help us with our planning."
  },

  { "id": "shared",
    "show_if": [ "app_category", "Caller", "Band_Solo", "Other" ],
    "q": "Are you willing to work with others on a shared event?",
    "optional": 1,
    "desc": "(NEFFA often gets applications for similar events.)",
    "choices": [
      { "val": "Yes" },
      { "val": "No" }
    ]
  },

  { "id": "url",
    "q": "Video URL",
    "optional": 1,
    "desc": "If you would like to share a video of you/your group performing, please give us the url here.  This is very helpful for us if you've not performed at NEFFA before or not in a while." },

  { "id": "notes",
    "textarea": 1,
    "optional": 1,
    "q": "Any additional questions, comments?" }
  
]
